src/DataProcessors/инкКонфигурацияВыплатВФонды/инкКонфигурацияВыплатВФонды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>инкКонфигурацияВыплатВФонды</name>
</mdclass:DataProcessor>

src/InformationRegisters/инкКонфигурацияВыплатВФонды/инкКонфигурацияВыплатВФонды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>инкКонфигурацияВыплатВФонды</name>
  <resources>
    <name>ПФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФСС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФФОМС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СтрокаТарифаВЗН</name>
    <type>
      <types>EnumRef.инкСтрокаТарифаВЗН</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/инкОсобыеУсловияТруда/инкОсобыеУсловияТруда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>инкОсобыеУсловияТруда</name>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>УсловияТрудаКласс</name>
    <type>
      <types>EnumRef.инкУсловияТрудаКласс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УсловияТрудаПодкласс</name>
    <type>
      <types>EnumRef.инкУсловияТрудаПодкласс</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/инкСтрокаТарифаВЗН/инкСтрокаТарифаВЗН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>инкСтрокаТарифаВЗН</name>
  <enumValues>
    <name>ОблагаемаяБазаВЗН</name>
  </enumValues>
  <enumValues>
    <name>ТарифВПределахЛимита</name>
  </enumValues>
  <enumValues>
    <name>ТарифСверхЛимита</name>
  </enumValues>
  <enumValues>
    <name>ТарифСвышеМРОТДляМСБ</name>
  </enumValues>
</mdclass:Enum>

src/Enums/инкУсловияТрудаКласс/инкУсловияТрудаКласс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>инкУсловияТрудаКласс</name>
  <enumValues>
    <name>Опасный</name>
  </enumValues>
  <enumValues>
    <name>Вредный</name>
  </enumValues>
  <enumValues>
    <name>Допустимый</name>
  </enumValues>
  <enumValues>
    <name>Оптимальный</name>
  </enumValues>
</mdclass:Enum>

src/Enums/инкУсловияТрудаПодкласс/инкУсловияТрудаПодкласс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>инкУсловияТрудаПодкласс</name>
  <enumValues>
    <name>Подкласс4</name>
  </enumValues>
  <enumValues>
    <name>Подкласс34</name>
  </enumValues>
  <enumValues>
    <name>Подкласс33</name>
  </enumValues>
  <enumValues>
    <name>Подкласс32</name>
  </enumValues>
  <enumValues>
    <name>Подкласс31</name>
  </enumValues>
  <enumValues>
    <name>Подкласс2</name>
  </enumValues>
  <enumValues>
    <name>Подкласс1</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/инкКодыБюджетнойКлассификации/инкКодыБюджетнойКлассификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>инкКодыБюджетнойКлассификации</name>
  <predefined>
    <items>
      <name>НДФЛ</name>
      <description>Налог на доходы физических лиц, 13%</description>
    </items>
    <items>
      <name>ПФ_НакопительнаяЧасть</name>
      <description>ПФ, накопительная часть трудовой пенсии</description>
    </items>
    <items>
      <name>ПФ_СтраховаяЧасть</name>
      <description>ПФ, страховая часть трудовой пенсии</description>
    </items>
    <items>
      <name>ТФОМС</name>
      <description>ТФОМС</description>
    </items>
    <items>
      <name>ФСС</name>
      <description>Фонд социального страхования</description>
    </items>
    <items>
      <name>ФФОМС</name>
      <description>ФФОМС</description>
    </items>
  </predefined>
  <attributes>
    <name>КодБюджетнойКлассификации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/инкКонфигурацияВыплатВФонды/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КодыБюджетнойКлассификации = "Коды бюджетной классификации";
	ЗагрузитьНастройкиВЗН();
	
КонецПроцедуры

&НаКлиенте
Процедура КодыБюджетнойКлассификацииНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.инкКодыБюджетнойКлассификации.Форма.ФормаСписка");	
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиВЗН()
	
	ЗагрузитьНастройки_КонфигурацияВыплатВФонды();
	ЗагрузитьНастройки_ОсобыеУсловияТруда();
	ФондТравматизмаСтавка = Константы.инкФондТравматизма.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуВТаблицу_КонфигурацияВыплатВФонды(инкСтрокаТарифаВЗН,РезультатЗапросаТаблица)
	
	ПоискТарифа = Новый Структура("СтрокаТарифаВЗН",инкСтрокаТарифаВЗН);
	ПоискМассив = РезультатЗапросаТаблица.НайтиСтроки(ПоискТарифа);
	
	КонфиурацияВылатВФондыСтрока = КонфиурацияВылатВФондыТаблица.Добавить();
	КонфиурацияВылатВФондыСтрока.СтрокаТарифаВЗН = инкСтрокаТарифаВЗН;
	
	Для каждого ПоискЭлемент из ПоискМассив Цикл
		ЗаполнитьЗначенияСвойств(КонфиурацияВылатВФондыСтрока,ПоискЭлемент);	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройки_КонфигурацияВыплатВФонды()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	инкКонфигурацияВыплатВФондыСрезПоследних.СтрокаТарифаВЗН КАК СтрокаТарифаВЗН,
		|	инкКонфигурацияВыплатВФондыСрезПоследних.ПФ КАК ПФ,
		|	инкКонфигурацияВыплатВФондыСрезПоследних.ФСС КАК ФСС,
		|	инкКонфигурацияВыплатВФондыСрезПоследних.ФФОМС КАК ФФОМС
		|ИЗ
		|	РегистрСведений.инкКонфигурацияВыплатВФонды КАК инкКонфигурацияВыплатВФондыСрезПоследних";
	
	РезультатЗапросаТаблица = Запрос.Выполнить().Выгрузить();
	
	ДобавитьСтрокуВТаблицу_КонфигурацияВыплатВФонды(Перечисления.инкСтрокаТарифаВЗН.ОблагаемаяБазаВЗН,РезультатЗапросаТаблица);
	ДобавитьСтрокуВТаблицу_КонфигурацияВыплатВФонды(Перечисления.инкСтрокаТарифаВЗН.ТарифВПределахЛимита,РезультатЗапросаТаблица);
	ДобавитьСтрокуВТаблицу_КонфигурацияВыплатВФонды(Перечисления.инкСтрокаТарифаВЗН.ТарифСверхЛимита,РезультатЗапросаТаблица);
	ДобавитьСтрокуВТаблицу_КонфигурацияВыплатВФонды(Перечисления.инкСтрокаТарифаВЗН.ТарифСвышеМРОТДляМСБ,РезультатЗапросаТаблица);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуВТаблицу_ОсобыеУсловияТруда(инкУсловияТрудаКласс,инкУсловияТрудаПодкласс,РезультатЗапросаТаблица)
	
	ПоискТарифа = Новый Структура;
	ПоискТарифа.Вставить("УсловияТрудаКласс",инкУсловияТрудаКласс);
	ПоискТарифа.Вставить("УсловияТрудаПодкласс",инкУсловияТрудаПодкласс);
	
	ПоискМассив = РезультатЗапросаТаблица.НайтиСтроки(ПоискТарифа);
	
	ОсобыеУсловияТрудаСтрока = ОсобыеУсловияТрудаТаблица.Добавить();
	ОсобыеУсловияТрудаСтрока.УсловияТрудаКласс    = инкУсловияТрудаКласс;
	ОсобыеУсловияТрудаСтрока.УсловияТрудаПодкласс = инкУсловияТрудаПодкласс;

	Для каждого ПоискЭлемент из ПоискМассив Цикл
		ЗаполнитьЗначенияСвойств(ОсобыеУсловияТрудаСтрока,ПоискЭлемент);	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройки_ОсобыеУсловияТруда()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	инкОсобыеУсловияТруда.УсловияТрудаКласс КАК УсловияТрудаКласс,
		|	инкОсобыеУсловияТруда.УсловияТрудаПодкласс КАК УсловияТрудаПодкласс,
		|	инкОсобыеУсловияТруда.Тариф КАК Тариф
		|ИЗ
		|	РегистрСведений.инкОсобыеУсловияТруда КАК инкОсобыеУсловияТруда";
	
	РезультатЗапросаТаблица = Запрос.Выполнить().Выгрузить();
	ДобавитьСтрокуВТаблицу_ОсобыеУсловияТруда(Перечисления.инкУсловияТрудаКласс.Опасный,
	                                          Перечисления.инкУсловияТрудаПодкласс.Подкласс4,
											  РезультатЗапросаТаблица);
	ДобавитьСтрокуВТаблицу_ОсобыеУсловияТруда(Перечисления.инкУсловияТрудаКласс.Вредный,
	                                          Перечисления.инкУсловияТрудаПодкласс.Подкласс34,
											  РезультатЗапросаТаблица);
	ДобавитьСтрокуВТаблицу_ОсобыеУсловияТруда(Перечисления.инкУсловияТрудаКласс.Вредный,
	                                          Перечисления.инкУсловияТрудаПодкласс.Подкласс33,
											  РезультатЗапросаТаблица);
	ДобавитьСтрокуВТаблицу_ОсобыеУсловияТруда(Перечисления.инкУсловияТрудаКласс.Вредный,
	                                          Перечисления.инкУсловияТрудаПодкласс.Подкласс32,
											  РезультатЗапросаТаблица);
	ДобавитьСтрокуВТаблицу_ОсобыеУсловияТруда(Перечисления.инкУсловияТрудаКласс.Вредный,
	                                          Перечисления.инкУсловияТрудаПодкласс.Подкласс31,
											  РезультатЗапросаТаблица);
	ДобавитьСтрокуВТаблицу_ОсобыеУсловияТруда(Перечисления.инкУсловияТрудаКласс.Допустимый,
	                                          Перечисления.инкУсловияТрудаПодкласс.Подкласс2,
											  РезультатЗапросаТаблица);
	ДобавитьСтрокуВТаблицу_ОсобыеУсловияТруда(Перечисления.инкУсловияТрудаКласс.Оптимальный,
	                                          Перечисления.инкУсловияТрудаПодкласс.Подкласс1,
											  РезультатЗапросаТаблица);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	СохранитьНастройкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	
	СохранитьНастройки_КонфигурацияВыплатВФонды();
	СохранитьНастройки_ОсобыеУсловияТруда();
	Константы.инкФондТравматизма.Установить(ФондТравматизмаСтавка);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки_КонфигурацияВыплатВФонды()
	
	КонфигурацияВыплатВФондыНабор = РегистрыСведений.инкКонфигурацияВыплатВФонды.СоздатьНаборЗаписей();
	Для каждого КонфиурацияВылатВФондыСтрока из КонфиурацияВылатВФондыТаблица Цикл
		КонфигурацияВыплатВФондыЗапись = КонфигурацияВыплатВФондыНабор.Добавить();
		ЗаполнитьЗначенияСвойств(КонфигурацияВыплатВФондыЗапись,КонфиурацияВылатВФондыСтрока);
	КонецЦикла;
	КонфигурацияВыплатВФондыНабор.Записать(Истина);
		
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки_ОсобыеУсловияТруда()
	
	ОсобыеУсловияТрудаНабор = РегистрыСведений.инкОсобыеУсловияТруда.СоздатьНаборЗаписей();
	Для каждого ОсобыеУсловияТрудаСтрока из ОсобыеУсловияТрудаТаблица Цикл
		ОсобыеУсловияТрудаЗапись = ОсобыеУсловияТрудаНабор.Добавить();
		ЗаполнитьЗначенияСвойств(ОсобыеУсловияТрудаЗапись,ОсобыеУсловияТрудаСтрока);
	КонецЦикла;
	ОсобыеУсловияТрудаНабор.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СохранитьНастройкиНаСервере();
	
КонецПроцедуры
